## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/57bace84-205a-4567-acdc-eb34b1af4809).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layers/core | Success :thumbsup:
**Dir**: layers/core
**Workspace**: default
**Success**: :thumbsup:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmp6ttczap8/plan`

```diff
2024-12-02T21:17:30.744Z [INFO]  OpenTofu version: 1.8.4
2024-12-02T21:17:30.744Z [DEBUG] using github.com/hashicorp/go-tfe v1.36.0
2024-12-02T21:17:30.744Z [DEBUG] using github.com/opentofu/hcl/v2 v2.0.0-20240416130056-03228b26f391
2024-12-02T21:17:30.744Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.1
2024-12-02T21:17:30.744Z [DEBUG] using github.com/zclconf/go-cty v1.14.4
2024-12-02T21:17:30.744Z [INFO]  Go runtime version: go1.21.11
2024-12-02T21:17:30.745Z [INFO]  CLI args: []string{"/usr/local/lib/tofuenv/versions/1.8.4/tofu", "show", "/tmp/tmp6ttczap8/plan"}
2024-12-02T21:17:30.745Z [DEBUG] Attempting to open CLI config file: /github/home/.tofurc
2024-12-02T21:17:30.745Z [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2024-12-02T21:17:30.745Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2024-12-02T21:17:30.745Z [DEBUG] ignoring non-existing provider search directory /github/home/.terraform.d/plugins
2024-12-02T21:17:30.745Z [DEBUG] ignoring non-existing provider search directory /github/home/.local/share/terraform/plugins
2024-12-02T21:17:30.745Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2024-12-02T21:17:30.745Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2024-12-02T21:17:30.745Z [DEBUG] Found the config directory: /github/home/.terraform.d
2024-12-02T21:17:30.745Z [INFO]  CLI command args: []string{"show", "/tmp/tmp6ttczap8/plan"}
2024-12-02T21:17:30.837Z [DEBUG] checking for provisioner in "."
2024-12-02T21:17:30.838Z [DEBUG] checking for provisioner in "/usr/local/lib/tofuenv/versions/1.8.4"
2024-12-02T21:17:30.838Z [DEBUG] created provider logger: level=debug
2024-12-02T21:17:30.838Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:17:30.852Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 args=[".terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0"]
2024-12-02T21:17:30.852Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=801
2024-12-02T21:17:30.852Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0
2024-12-02T21:17:30.864Z [INFO]  provider.terraform-provider-cloudflare_v4.47.0: configuring server automatic mTLS: timestamp=2024-12-02T21:17:30.864Z
2024-12-02T21:17:30.880Z [DEBUG] provider.terraform-provider-cloudflare_v4.47.0: plugin address: address=/tmp/plugin3722887865 network=unix timestamp=2024-12-02T21:17:30.880Z
2024-12-02T21:17:30.880Z [DEBUG] provider: using plugin: version=6
2024-12-02T21:17:30.912Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:17:30.914Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=801
2024-12-02T21:17:30.914Z [DEBUG] provider: plugin exited
2024-12-02T21:17:30.914Z [DEBUG] created provider logger: level=debug
2024-12-02T21:17:30.914Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:17:30.919Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null args=[".terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null"]
2024-12-02T21:17:30.920Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=810
2024-12-02T21:17:30.920Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null
2024-12-02T21:17:30.923Z [INFO]  provider.terraform-provider-null: configuring server automatic mTLS: timestamp=2024-12-02T21:17:30.923Z
2024-12-02T21:17:30.938Z [DEBUG] provider: using plugin: version=5
2024-12-02T21:17:30.938Z [DEBUG] provider.terraform-provider-null: plugin address: address=/tmp/plugin204302701 network=unix timestamp=2024-12-02T21:17:30.938Z
2024-12-02T21:17:30.950Z [DEBUG] No provider meta schema returned
2024-12-02T21:17:30.950Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:17:30.951Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=810
2024-12-02T21:17:30.951Z [DEBUG] provider: plugin exited
2024-12-02T21:17:30.951Z [DEBUG] created provider logger: level=debug
2024-12-02T21:17:30.951Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:17:30.957Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 args=[".terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1"]
2024-12-02T21:17:30.957Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=818
2024-12-02T21:17:30.957Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1
2024-12-02T21:17:31.008Z [INFO]  provider.terraform-provider-akash_v0.1.1: configuring server automatic mTLS: timestamp=2024-12-02T21:17:31.008Z
2024-12-02T21:17:31.027Z [DEBUG] provider: using plugin: version=5
2024-12-02T21:17:31.027Z [DEBUG] provider.terraform-provider-akash_v0.1.1: plugin address: address=/tmp/plugin2351285331 network=unix timestamp=2024-12-02T21:17:31.027Z
2024-12-02T21:17:31.047Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:17:31.209Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x8b     \xff\x9cVkl\xd7\xf5\xff\xaf\xbdk_\xaf{\xfcZ\xaf_\xe3\xeb\xbbk{\xc6;\xb6y\xe4\xc10!\xb2jTE\x8d"g\x98\xbd^\x8f\xcflgf\xfcͪ\x92\x88\xaaO\xa9\x8d\xda~KT\xa2\xb6"\xa4ARE4\xa2mJ\x88\x8ah\xa5\x86*Q\xaa\xb6\xa1\x8aH\x94\xa6-\x8d\x924\xf0!ս\xb3/\xc3\xd6@-y\xbd\xbe\xbf\xdf\xf9\x9ds\xcfkfυ\xb7^|\xff\xfc\xfe\xf4\x86\x83$ 5\xe1 \xa9\x85\xe0ܥo<\xf9\xf8\x97\xc4\xd7\xc7WO\	R <\xfe\xf7\xd7ji\x88\xe0\xcd \x92\x84 \x84!\xa9\x8eFI\x9e\xfd\xc5\xc5Z$5\xe0\xd0\xa9\x85\xcf\x82Q\xf5X/\x91$!\xb5ЀR\x98\xa9ſ\xbdw\x91\xeb\xe1'5\x82\x84FlX\x9f:\xfb[\x8e\x85\xe0\xbb\x81\x85\xa0	\x9b\xa4f
2024-12-02T21:17:31.209Z [DEBUG] provider.terraform-provider-akash_v0.1.1: $\x84g\xffy\x99cup޷\xab\x83l\x91"4J\xea\xf0\xf8\x97\xb9\xffz\xe8\xa0!B\xe0\x9fQ\x80 \xb5&	!ІmR\x84\xa9\xc7c\x9f\x9dx\xc7g5@;\xb6\x8c\xe0\x8b?\xbe\xca}\x84\xe1\xafu\xc2:\xb0C\xea\xa4@\xf0\xf4\xf5\xf78\xd6\xaf6	\xac\xa2\x95:i\x84\x84\xf1\xc4\xdb\xc7B4H\x9a %\xa0&\xe8\xc2.	)\x90F|\xf9\xf4s!"\xcdp\xd2w\xd7\xdd\xd8-\xc5(\x90&|\xfd\x87\xcfs\xac^\xf2\xb1\xe8\xc1\xa9\x97iƗ^9ͱ\x9c\xf2S\x81>\xec\x93\xfai\x84\xb4\xe0\xf3'Osw y\xe1` \xc1\xab'\xae5\xd3 i\x856\xb5\x82\x84\x924H\x81 \x9e\xbc\xfc\xcd"mp\xddWl\x8aTj\xeb\x86 \xf0*\x87!PS\xd5Փ\x86pcSsK(\x90V\xbc\xf2\xbd\xd7\xf9\xbd\xdb\xe1\xaa/\xd9\xc38,\xd5\xd1N҆\xbe\xf2\x9e\xf78B\x83\xa4\xf6
2024-12-02T21:17:31.209Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x9f0\x82#\xa2\xec\x9d0\x8a\xa3\xd2
2024-12-02T21:17:31.209Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xa4\xdfxN\x94=Z,m\xe2\x97\xc24J:\xf0\xecIQ\xf6.\xf8z\x80	\xc2#B\xa7\x98\x90\xc2IB\x92\x98mЉ_\xabl!Q|\xf6\x8dwyݐf\xdd0\x86c\xd28\x8d\x92.|\xe5\xe8u\xc5`\x88\x86H\xfc\xd9Os&pBO\xd22ʒB\x81 ~\xf5\xd3\xcf\xf8={\xe1\xb8\xcf\xea\x85I\x9cX7\xde(\x91\xaa\xad\xab\x98\xb0\x96ֶ\xf6\x8e\xcehv\xd3\xc3k\xd7
2024-12-02T21:17:31.209Z [DEBUG] provider.terraform-provider-akash_v0.1.1: c\xf2t4Jz\xf0ع\x8b<\x88\xe2p|\x80 ҋ\xcf^\x8d\xd8O\xfa\xfb \x85)\xd1\xd0}x\xfe\xd1\xd0\xfd 4D\xe0C\xbfb\xfd\xa0\xa2*z \xa6pJ\x8a\xd0\xe9\xc7.	\xae\x96\xb8\xbf\xd38-\xfay y\xeaS~\xa7A\xf8\x87?\xb3\x830\x833\xd2F!>\xf1\x87OxX\xb6
2024-12-02T21:17:31.209Z [DEBUG] provider.terraform-provider-akash_v0.1.1: 3
2024-12-02T21:17:31.209Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x9bp\x93\x80\xf1\xa7\xc7?\xe6\xd0l\xd0l\xc6\xcd\xd2
2024-12-02T21:17:31.209Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x84\xe2\xa5_}\xc8\x87\xe1t\xa3\xc0\x86\xe1\xbcG\xba\x97\xf6\x91!\xfcαw\x834DF\xe0F\x98\x86\xc8(|\xa6A\xb2\\xe0\xebb\xee\xc3\xfb\xa4{\x93\x84\x8c\xc2\xfdx\xbf\xf8\xb6\xb6\xe2V\xe9\xff)\x90a|\xf9\xdcun\x87o\xfbw\x8d\xc36\xdc&m\xa7@F\xf0\xe7W\xbe\xcfg!7\xfc\xb1L\xc0\xdc!\xcdR \xa3x\xe6M\x81%\xe1w>\x96\x84\x9d\xb8S`\xf0\xd5\xdfl\xce\xf9\xd8\xec\xc2]\xd2lE\xc7\xc7zj\x83\xbd}\xfd\xd2 \xe5\xadǏN^\xe0w\xc0\xc7\xa2\x84	\xfc\xf5\xa9\x8a\x8e\xc3?\xc4qx \x9b+\x89,n\xb5Ո\xf2\x8e\xe1џ\x89\xa6\x9e\x80o\xf9\xec	؍\xbbE\x8f\xe3\xd3\xd7D\xe9\xeb\xe05Ύ\x90	|\xeb\xfa\xfb<\xe52\xf4\x89\xb4ʰ\xf7HR 2>\xf1\xb6(\xa2R\xbc\x85{q\xaf\xa8\x94\x82g\x8aE\xdc\x81\xb6X\xb1/[\xe3\x89\xe4\xd8x]\xfd\x84\xac\xee\x80\xd5\xd5\xd5\=w\xad9\xbeos \xd6Aj`\xf5\x99\xff\xf7\xe7\xb8\xfa\xf17\xfeP,Fj9\xef\xc6\xe7\xfc'\x80\xab\xcf\xbf\xc6\xf7\xab\xff\xa7ֻ\xdar\xd6d\xae\xd2\xed\x9c婵z6\xa76Z\x9ae\xbbL\xb7\xad\xb4\xab\x8e\xe8\xceJֳf\x9aF\xd63tŰ<\xe6X\x9a\xa9,\x9a'gg\xd4\xd4\xfe\x9c\xa9\x8e\xeb\xebє쌚Z\xe0\xa7匭N\xea\xeb\xb1\xe5xrnFM\xed2\xd92\xb3\xbc\x84\xcc\xf5\xd7C\xe8s\xe1\xa9\xff*l\xae\xc7\xf4\x82\xf4\x9cmp\xe1\x9dv\xee\xa0\xc9\xd4\xb71*\xa9o\xbaq\xad\xfa\xbc\xae\x99\x9a\xb3?gzj\xfc&C\x99\xe7c6\xe7\xe4Y\x81\xb5Cs\x99`v\xdd\xc4,\xf9\x8e=\xedjr\x9e9\xc6\xe2\xcanf1\xc7\xd0\xd5\xceJL\xf1[m\xaf<.\x98\xa8=\x95\x87>w\xc1\xb25w\xf9V\x8b/
2024-12-02T21:17:31.209Z [DEBUG] provider.terraform-provider-akash_v0.1.1: '各g\xffp\xfb\xfcéRHGf&\xb7\xc8\xfa\xd3\xcdK\xf3r+\xf9\xe6\x98\xf8\xe0\xf2}\xdf\xfcP\x9eu\x98\xe6\xb1Y\xe6xƢ\xa1kS\xc72\x86\xb7\x94;(\xeb\xf6\xb2\xb2\xa4\xb9K\x86n;Y%cOd\xcd\ư\xe4\xb3\x98\xa3\xf96\xea\xc4\xfa\xe4m\xf9\x94<-O+˞\xe9r\xd7\xc3\xeb\xd3\xe5y\xe6䙪\xac\xcf*\x8a\xba\x9c\xecp\xd9U<\xe68ڢ\xed,"\x9f\xc8؊\xb7\x98ul\xcf\xce\xcf(\xde\xe2LA\xc0w\xba\xffN5\xb6\xe5'\xe5-r\xaa\x9a\xd4݇\xe4\xa6)yU\xc9\xfa\xa9-\xc5䇴\xf3\xceB\xf25\xb6\xe5U9\xb5I\x9e,h\xf9\xa1\xf0\xe4l\xb9\x95\x82u!'˚a\xc9\xfcC\x95*\xb2\xe9\xd8y#͜	\xed\x90\xe6.)\xe6~\x9a\x9c\x9c\xe5\xcb\xcc\xe7G
2024-12-02T21:17:31.209Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xff)Y\xc7\xd69|\xf3\xf0U\xd9`\xf3_\xcei[g{,\xda-k\xe92z\xd0\xca3ǻ\xa3ui*\xbf\x81Z\x98\x9b[wp\xb5\xadvp\xc5c\xee]\xda\xec6\x837\xf9kJ\xec\xca\xf6\xf6\xc5E\xc3bkG8\xab9.\xdb5;\xe7y\xcdc\xfb\xd8\xcaڱw\x99.\x96򚱟\xbbŦ\xb8\xd9\xf8\xa4
2024-12-02T21:17:31.209Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xc5
2024-12-02T21:17:31.212Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xbd\xd6BD\x9e\xe9\xf2_\x9e\x8ch\xf9H~dfr\xcb>\xb62\xa7\x8e\x8a\x85sM\xb9F\xc6*\xaeǢH\xb9鈯-u`\x8d}<Y\x8e"\xe1\xee/x\x9c\xf1\xa4?\xc2{4+\xed.i\x87ؼ\xa7y\xec\xc0C󩩄\xec2+-\xe6ȩ\xdcn\xc3ese\xa9h\xb6\xe0\xcb,x\xa6\x9b\x9a\x923\xb6\x9a*\xb3\xd6wR\x92P\xe9\x93Y۲xN\x9e\x95\xa3S\xfb˜[\x9cs\xb7Ce\\x8e4Jfm\xcbcG<\xb5\xadLRt\xdb\xb3WͰ\x94\x94\xa2aoٰ\xa4^"\xa9[3\xb6\x9d1\xf9\xc605+#\xdbNF\xc98Y]\xd1\x96f\x96gh&\xb7\xf2Lw\xd6ai7\xe1o\x88\x8a\xbb\xa5\xaaۋe\xbdY\x9e\xac\xd4\xb5\xcb\xd8\xea}\xd5Mʛ\xc1s4\xcb\xcdڎ'?\xcc\xfb\xb5<P<R\xb7W\xb7.94\x8aoH%e\xc9\xf3\xb2j\xa1\xd8< \xb5\xba\x84O\xfa\xce\xb2\xc5\xef9p`N-\xbb\x8dW\xb7)\xb9\xf5[\x89\xab\xcbՙ꼶&\xfb\x82v\x98\xb7\x8b:~[\xbe\x88J^\xccY\xfa\xd4:/oն\xd1\xf6t\xba\xd4\xfa\xc5\xfd%\xf6J\xe5\xeb\x8fx\xf5\xa9l%\xff\xfd\xa6\xd4#|@\xfd\xf7\x8a\xca\xd4r\xde\xbf\xee\xa6ô\xf4\xaci0˫̣\x81\xc2c_9l;\x87ܬ\xa63\xc5\xd4V\x98û\xdca\x8a\z \xf1G\x8ax \xb9\x8a\xc32\x86\xeb9+eP6l\xc5\xcc-\xb3\xc3\xec\xa0\xe2?\x9f&唜RL\xc3\xcaYЖ\xd3\xa7+_\xd6<\xca\xf2\x82\xab\xd6=\x9aO\xbb\xf6cj\xf8Ѽ\xbb\xe2\xea\x9ai>\xf6\x9f   \xff\xff\xc5Z\xf6\xdc\xd1  
2024-12-02T21:17:31.212Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=818
2024-12-02T21:17:31.212Z [DEBUG] provider: plugin exited

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = []
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```


</details>


---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
